#--------------------------------------------------------------------------
# 화일명 : w2_R기초_1_작업환경.R
# 설  명 : 통계 데이터 분석 (R기초 - 작업환경)
# 일  자 : 2020.11.06
# 생성자 : Jigwan
# 패키지 : 
# 분석방법: 
#--------------------------------------------------------------------------

#--------------------------------------------------------------------------
# 0. 환경 설정
#--------------------------------------------------------------------------
## 작업 디렉토리 설정
setwd("C:/work/RProject/rstatistics")
getwd()

setwd("..")
getwd()
setwd("rstatistics")
getwd()

#R 실행시 아래 참조 파일에 setwd 명령을 추가로 등록해서 사용도 가능
#(아래) C:\Program Files\R\R-4.0.2\etc\Rprofile.site
#R Source 파일 불러와서 실행하기
source("PrintHello.R")

a <- getwd()
a


#--------------------------------------------------------------------------
#1. Save Workspace (.RData)
#--------------------------------------------------------------------------
save.image()
#또는 종료시 저장여부 확인으로 저장
#q()

#일부 변수만 저장
hero <- c("Superman", "Batman", "Spiderman")
ls()
save(hero, file="hero.rda")
rm(hero)
ls()
load("hero.rda")
ls()
hero

#--------------------------------------------------------------------------
#2. 현재 작업공간에 생성된 변수화 함수 확인
#--------------------------------------------------------------------------
ls()


x <- 100
y <- c(2,3,5,7)
#섭씨 -> 화씨로 변환하는 함수
f <- function(y) (y-32)/1.8
hero <- c("Superman", "Batman", "Spiderman")

ls()
#변/함수 내부 구조까지 확인
ls.str()

#변/함수 삭제
z <- 3.14
z
rm(z)
z
rm(x,y)
ls()
#모든 변수 일괄 삭제
rm(list = ls())
ls()

#--------------------------------------------------------------------------
#3. 현재까지 사용했던 명령어 확인
#--------------------------------------------------------------------------
history()
#History 탭에서도 확인이 가능

