#--------------------------------------------------------------------------
# 화일명 : w6_R기초_1_입력.R
# 설  명 : 통계 데이터 분석 (R기초 - 입력)
# 일  자 : 2020.11.16
# 생성자 : Jigwan
# 패키지 : 
# 분석방법: 
#--------------------------------------------------------------------------

#--------------------------------------------------------------------------
# 0. 환경 설정
#--------------------------------------------------------------------------
## 작업 디렉토리 설정
#setwd("C:/work/RProject/rstatistics")
getwd()


#--------------------------------------------------------------------------
# R의 파일 읽기 함수
#--------------------------------------------------------------------------
# 정형화된 데이터(e.g. table 형식) 읽기 
# - read.csv() : CSV 형식
# - read.table() : 테이블 형식
# - read.fwf() : 고정 길이 형식
#
# 비 정형화된 데이터 읽기
# - readLines() : 라인 단위 읽기
# - scan() : 항목 단위 읽기
#
# - read.xlsx() : 엑셀 형식
# 
# R의 파일 읽기 함수에 파일이 위치한 URL을 인수로 지정하면
# 웹사이트에 링크된 파일을 읽어올 수 있음


#--------------------------------------------------------------------------
# read.csv()
#--------------------------------------------------------------------------
read.csv(file="files/product.csv")
?read.csv

read.csv(file="files/product-with-no-header.csv", header = F)


#--------------------------------------------------------------------------
# read.table()
#--------------------------------------------------------------------------
?read.table
read.table(file="files/product.txt", header = T)
read.table(file="files/product-colon.txt", header = T, sep = ":")
read.table(file="files/product-missing.txt", header = T, na.strings = ".")


#--------------------------------------------------------------------------
# read.fwf()
#--------------------------------------------------------------------------
read.fwf(file="files/product-fwf.txt", widths=c(4, -1, 10, 8), # -1 : 한 칸 띄고
         col.names = c("id", "name", "price")) 


#--------------------------------------------------------------------------
# readLines()
#--------------------------------------------------------------------------
readLines(con="files/won-dollar.txt", n=2) # n : 읽어들일 라인수 지정


#--------------------------------------------------------------------------
# scan()
#--------------------------------------------------------------------------
# 라인 단위가 아닌, 데이터 항목 단위로 읽고 처리
# what : scan함수가 읽어 들일 데이터 항목의 유형을 지정
# character() : 각 데이터 항목에 대해 문자로 처리
scan(file="files/won-dollar.txt", what = character()) 

scan(file="files/won-dollar.txt", 
     what = list(date=character(), # 날짜, 살때환율, 팔때환율
                 buy=numeric(), 
                 sel=numeric()))

scan(file="files/won-dollar.txt", 
     what = list(date=character(),
                 buy=numeric(), 
                 sel=numeric()),
     nlines = 2)

scan(file="files/won-dollar.txt", 
     what = list(date=character(),
                 buy=numeric(), 
                 sel=numeric()),
     skip = 3) # skip=3 : 3 번째 라인까지 무시하고 4번째 라인부터 적용


#--------------------------------------------------------------------------
# read.xlsx()
#--------------------------------------------------------------------------
# install.packages("openxlsx")
library(openxlsx)
read.xlsx(xlsxFile="files/product.xlsx", sheet = 1)
