#--------------------------------------------------------------------------
# 화일명 : 이미지_복제_수정.R
# 설  명 : 이미지 파일로드, 이미지에 텍스트 인쇄, 수정 된 이미지 저장 [복제]
# 일  자 : 2020.11.06
# 생성자 : Jigwan
# 패키지 : 
# 분석방법: 
#--------------------------------------------------------------------------

#--------------------------------------------------------------------------
# 0. 환경 설정
#--------------------------------------------------------------------------
## 작업 디렉토리 설정
#setwd("C:/work/RProject/rstatistics")
getwd()


#--------------------------------------------------------------------------
# 이미지 파일로드, 이미지에 텍스트 인쇄, 수정 된 이미지 저장 [복제]
#--------------------------------------------------------------------------
#install.packages("png")
library(png)

#read file
img <- readPNG("./image/dataStructure.png")
#get size
h <- dim(img)[1]
w <- dim(img)[2]

#open new file for output
png("./image/out.png", width=w, height=h)
par(mar=c(0,0,0,0), xpd=NA, mgp=c(0,0,0), oma=c(0,0,0,0), ann=F)
plot.new()
plot.window(0:1, 0:1)

#fill plot with image
usr <- par("usr")    
rasterImage(img, usr[1], usr[3], usr[2], usr[4])

#add text
text(.5,.5, "Data Sttucture", cex=5, col=rgb(.2,.2,.2,.7))

#close image
dev.off()

